
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/20906657611)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * ansible_group.windows_operator
  * ansible_host.windows_operator[&#34;01&#34;]
  * proxmox_vm_qemu.windows_operator[&#34;01&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # ansible_group.windows_operator will be created
  + resource "ansible_group" "windows_operator" {
      + id        = (known after apply)
      + name      = "windows_operator"
      + variables = {
          + "ansible_ssh_private_key_file" = "/home/machine-user/.ssh/id_ed25519"
          + "ansible_user"                 = "machine-user"
        }
    }

  # ansible_host.windows_operator["01"] will be created
  + resource "ansible_host" "windows_operator" {
      + groups    = [
          + "windows_operator",
        ]
      + id        = (known after apply)
      + name      = "prd-wop-01"
      + variables = (known after apply)
    }

  # proxmox_vm_qemu.windows_operator["01"] will be created
  + resource "proxmox_vm_qemu" "windows_operator" {
      + additional_wait           = 5
      + agent                     = 1
      + agent_timeout             = 90
      + automatic_reboot          = true
      + automatic_reboot_severity = "error"
      + balloon                   = 0
      + bios                      = "ovmf"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + cicustom                  = "user=local:snippets/prd-wop-01_cloud-init.yaml"
      + ciupgrade                 = false
      + clone                     = "winsrv-2025"
      + clone_wait                = 10
      + current_node              = (known after apply)
      + default_ipv4_address      = (known after apply)
      + default_ipv6_address      = (known after apply)
      + define_connection_info    = true
      + description               = "Windows VM to operate something. This VM is managed by Terraform."
      + force_create              = false
      + full_clone                = true
      + hotplug                   = "network,disk,usb,memory,cpu"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.21.18/24,gw=192.168.21.1"
      + kvm                       = true
      + linked_vmid               = (known after apply)
      + memory                    = 4096
      + name                      = "prd-wop-01"
      + os_type                   = "cloud-init"
      + protection                = false
      + qemu_os                   = "win11"
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-single"
      + skip_ipv4                 = false
      + skip_ipv6                 = false
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + start_at_node_boot        = true
      + tablet                    = true
      + tags                      = "prd;terraform;operator;windows-operator"
      + target_node               = "pve-01"
      + unused_disk               = (known after apply)
      + vm_state                  = "running"
      + vmid                      = 105

      + cpu {
          + cores   = 2
          + limit   = 0
          + numa    = true
          + sockets = 1
          + type    = "x86-64-v3"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "40G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + startup_shutdown {
          + order            = -1
          + shutdown_timeout = -1
          + startup_delay    = -1
        }

      + vga {
          + type = "serial0"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":240,"Program":"tfcmt","SHA1":"4f628481a3731cf54506e34fe4f2e00140c5e61a","Vars":{},"WorkflowName":"Terraform CI"} -->